In [2]:
import pandas as pd

In [6]:
lst = [1,2,3,4]
s = pd.Series(lst, dtype= float, index= ['A','B','C','D'])
s

A    1.0
B    2.0
C    3.0
D    4.0
dtype: float64

In [4]:
lst

[1, 2, 3, 4]

In [9]:
x= pd.Series(['Norah','Majed'])
y= pd.Series(['Jaber','Mohamed'])
z = pd.concat([x,y], ignore_index=True)
z

0      Norah
1      Majed
2      Jaber
3    Mohamed
dtype: object

In [13]:
n = s.drop('C')

In [14]:
n

A    1.0
B    2.0
D    4.0
dtype: float64

In [15]:
n.drop('B', inplace=True)

In [16]:
n

A    1.0
D    4.0
dtype: float64

In [19]:
V = pd.Series([22,30,90,22,44,44])
V

0    22
1    30
2    90
3    22
4    44
5    44
dtype: int64

In [20]:
V.drop_duplicates(inplace=True)

In [21]:
V

0    22
1    30
2    90
4    44
dtype: int64

In [22]:
V2 = V.copy()

In [23]:
V2

0    22
1    30
2    90
4    44
dtype: int64

In [26]:
V2.drop(1, inplace=True)

In [27]:
V2

0    22
2    90
4    44
dtype: int64

In [28]:
V

0    22
1    30
2    90
4    44
dtype: int64

In [29]:
j = pd.Series([1,2,3,4,5])

In [30]:
j = j.add(7)

In [31]:
j

0     8
1     9
2    10
3    11
4    12
dtype: int64

In [32]:
j = j.sub(2)
j

0     6
1     7
2     8
3     9
4    10
dtype: int64

In [34]:
j = j.mul(40)
j

0    240
1    280
2    320
3    360
4    400
dtype: int64

In [35]:
j = j.div(8)
j

0    30.0
1    35.0
2    40.0
3    45.0
4    50.0
dtype: float64

In [1]:
import pandas as pd
import numpy as np

# إنشاء DataFrame
data = {'Level': [100, 100, 100, 200, np.nan, 200, 300, 300, np.nan],
        'Course Name': ['Introduction to IT', 'Programming Fundamentals', 'Introduction to MIS',
                        'Database Management', 'Data Structures', 'Systems Analysis and Design',
                        'Network Security', 'Algorithms', np.nan],
        'Major': ['IT', 'CS', 'MIS', np.nan, 'CS', 'MIS', np.nan, 'CS', np.nan]}

df = pd.DataFrame(data)

In [2]:
df.describe()

            Level
count    7.000000
mean   185.714286
std     89.973541
min    100.000000
25%    100.000000
50%    200.000000
75%    250.000000
max    300.000000

In [3]:
df['Level'] = df['Level'].astype(float)

In [4]:
df.head(4)

   Level               Course Name Major
0  100.0        Introduction to IT    IT
1  100.0  Programming Fundamentals    CS
2  100.0       Introduction to MIS   MIS
3  200.0       Database Management   NaN

In [5]:
df = df.dropna(how='all')

In [6]:
df

   Level                  Course Name Major
0  100.0           Introduction to IT    IT
1  100.0     Programming Fundamentals    CS
2  100.0          Introduction to MIS   MIS
3  200.0          Database Management   NaN
4    NaN              Data Structures    CS
5  200.0  Systems Analysis and Design   MIS
6  300.0             Network Security   NaN
7  300.0                   Algorithms    CS